<a href="https://colab.research.google.com/github/CarolinaNovaesGN/projeto-dataset-markt/blob/main/pysparkSQL_mini_projeto.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Instalando e confifurando spark/sparkSQL**

In [ ]:
!pip install pyspark
from pyspark.sql import SparkSession
import pyspark.sql.functions as F
from pyspark.sql.functions import *
from pyspark.sql.window import Window as W
spark = (SparkSession.builder
        .master("local")
        .appName("mini-projeto-sql")
        .config("spark.ui.port","4050")
        .getOrCreate())

Collecting pyspark
  Downloading pyspark-3.2.0.tar.gz (281.3 MB)
     |████████████████████████████████| 281.3 MB 34 kB/s
Collecting py4j==0.10.9.2
  Downloading py4j-0.10.9.2-py2.py3-none-any.whl (198 kB)
     |████████████████████████████████| 198 kB 49.9 MB/s
Building wheels for collected packages: pyspark
  Building wheel for pyspark (setup.py) ... done
  Created wheel for pyspark: filename=pyspark-3.2.0-py2.py3-none-any.whl size=281805912 sha256=c05b5644503ec503f0d6629dc6ba65b780e5589949a498a401d23c324fd9a1b4
  Stored in directory: /root/.cache/pip/wheels/0b/de/d2/9be5d59d7331c6c2a7c1b6d1a4f463ce107332b1ecd4e80718
Successfully built pyspark
Installing collected packages: py4j, pyspark
Successfully installed py4j-0.10.9.2 pyspark-3.2.0

**Criando a tabela temporária para as consultas em SQL**

In [ ]:
df = spark.read.format("csv").option("inferSchema","true").option("header","true").option("sep",",").load("/content/pysp_df_geral2.csv").createOrReplaceTempView("dados_compras_table")

**Visualizando a tabela**

In [ ]:
query='''
SELECT *
FROM dados_compras_table
LIMIT 10
'''
spark.sql(query).toPandas()

   nmr_linha    id  ano_nascimento  ... total_produtos total_compras   ano
0          0  5524            1957  ...           2724            33  2012
1          1  2174            1954  ...             54             9  2014
2          4  5324            1981  ...            645            30  2014
3          6   965            1971  ...            900            33  2012
4          7  6177            1985  ...            261            18  2013
5         11   387            1976  ...            126             9  2012
6         12  2125            1959  ...           2577            12  2013
7         13  8180            1952  ...            243            27  2013
8         14  2569            1987  ...             96             6  2012
9         15  2114            1946  ...            915            24  2012

[10 rows x 24 columns]

**1 - Contando quantas reclamações foram reportadas:**

In [ ]:
query='''
SELECT COUNT(reclamacoes) 
AS qts_reclamacoes 
FROM dados_compras_table 
WHERE reclamacoes != 0
'''
spark.sql(query).toPandas()

   qts_reclamacoes
0               15

comparando com a quantidade de linhas da tabela

In [ ]:
query='''
SELECT COUNT(id) 
FROM dados_compras_table
'''
spark.sql(query).toPandas()

   count(id)
0       1634

Apenas 0,9 % dos clientes fizeram uma reclamação

**2 - Qual estado civil consome mais?**

In [ ]:
query='''
SELECT status_conjugal,
sum(total_produtos)  as qtd
FROM dados_compras_table 
group by status_conjugal
order by qtd desc
'''
spark.sql(query).toPandas()

  status_conjugal     qtd
0          Casado  705585
1        Solteiro  427116
2      Divorciado  185586
3           Viuvo   77205

Pessoas casadas são o maior público da loja.

**3 - Cliente com a maior renda e quantos produtos ele adquiriu.**

In [ ]:
query = '''
SELECT MAX(renda) 
AS maior_renda 
FROM dados_compras_table
'''
spark.sql(query).toPandas()

   maior_renda
0     160803.0

In [ ]:
query = '''
SELECT * 
FROM dados_compras_table 
WHERE renda = 160803 
'''
spark.sql(query).toPandas()

   nmr_linha    id  ano_nascimento  ... total_produtos total_compras   ano
0        687  1501            1982  ...           5025            45  2012

[1 rows x 24 columns]

**4 - IDs das 20 maiores compras**

In [ ]:


query='''
SELECT id, 
total_compras, 
ano 
FROM dados_compras_table 
ORDER BY total_compras DESC LIMIT 20
'''


spark.sql(query).toPandas()

       id  total_compras   ano
0    4619             81  2014
1   10311             75  2013
2    6237             69  2013
3    3594             63  2012
4    8581             57  2013
5     531             57  2012
6    4478             57  2013
7    5207             57  2012
8    2408             57  2012
9    3678             57  2012
10   6892             54  2014
11   6439             54  2012
12   1456             51  2013
13    635             51  2013
14   6097             51  2013
15   2849             51  2013
16   3427             51  2013
17  10159             51  2013
18   3478             51  2013
19   1081             51  2013

Mais da metade das 20 maiores compras foram feitas por pessoas com nível de escolaridade: graduação


**5-10 Maiores compras em 2014**

---

In [ ]:
query='''
SELECT 
 RANK() OVER (PARTITION BY ano ORDER BY total_compras Desc) as Rank,

 ano,
 total_compras,
 id as id
 
FROM dados_compras_table
WHERE ano=2014
ORDER BY total_compras Desc  LIMIT 10
'''
spark.sql(query).toPandas()

   Rank   ano  total_compras     id
0     1  2014             81   4619
1     2  2014             54   6892
2     3  2014             48   5136
3     4  2014             45   8475
4     4  2014             45   9931
5     4  2014             45   6862
6     7  2014             42   1584
7     8  2014             39   3924
8     8  2014             39  10846
9     8  2014             39   6722

In [ ]:
query='''
SELECT 
id,count(id) as quantidade
FROM dados_compras_table
group by id
having quantidade=1
'''
spark.sql(query).limit(5).toPandas()

     id  quantidade
0  6336           1
1  5300           1
2  5156           1
3  8086           1
4  6357           1

**6- Quantos produtos são adquiridos por compra em média?**

In [ ]:
query='''
SELECT
total_produtos,
total_compras,
total_produtos/total_compras as media
FROM dados_compras_table

LIMIT 5
'''
spark.sql(query).toPandas()

   total_produtos  total_compras      media
0            2724             33  82.545455
1              54              9   6.000000
2             645             30  21.500000
3             900             33  27.272727
4             261             18  14.500000

**7- Quem compra mais? Quem tem criança ou não?**

In [ ]:
query='''
SELECT criancas_casa,
sum(total_produtos)  as qtd
FROM dados_compras_table 
group by criancas_casa
order by qtd desc
'''
spark.sql(query).toPandas()

   criancas_casa      qtd
0              0  1198683
1              1   190068
2              2     6741

**8 - Maiores compras de ouro**

In [ ]:
query='''
SELECT id,
ouro_produtos
FROM dados_compras_table 
order by ouro_produtos desc
LIMIT 5
'''
spark.sql(query).toPandas()

      id  ouro_produtos
0  10311            321
1   6237            291
2   4246            262
3  10936            249
4   6721            248

**9- Qual estado civil consome mais carne?**

In [ ]:
query='''
SELECT status_conjugal,
sum(carne_produtos)  as qtd
FROM dados_compras_table 
group by status_conjugal
order by qtd desc
'''
spark.sql(query).toPandas()

  status_conjugal     qtd
0          Casado  137888
1        Solteiro   87059
2      Divorciado   34840
3           Viuvo   14085

**Só tem valores 0 e 1 na coluna reclamações?**

In [ ]:
query='''
SELECT COUNT (DISTINCT reclamacoes)
FROM dados_compras_table 
'''
spark.sql(query).toPandas()

   count(DISTINCT reclamacoes)
0                            2